# 函数中的参数类型


# 普通参数，默认参数，收集参数，命名关键字参数，关键字参数收集

# 普通参数 是位置参数，也叫顺序参数，也是鼻血传递的参数
# def func(x, y):
#     print(x, y)
#
# func(1, 2)


# 要求有三个参数，x，y，i至少传递两个，那么这时最后一个参数就是默认参数，但是默认参数，需要在定义形式参数时，指定默认值
# def func(x, y, i=100):
#     print(x, y, i)
# func(1, 2, 3)  # 在调用时传递了默认的参数，那么里面使用的就是传递的实参
# func(1, 2)  # 调用时没有传递默认参数，就会使用默认参数


# 收集参数
#定义一个形参，专门收集多余的实参，或理解为不确定需要传递多少个实参，直接用一个形参来接收
# 定义函数时，如果需要收集参数，那么这个形参前需要加一个 *  如 *arg
# 接收多余参数，会储存在args中，形成一个元组

# def func(x, y, z=100):
#     print(x+y+z)
#
# func(100, 200)

def func(x='+', *args):
    print(type(args))  # <class 'tuple'>
    if x == '+':
        print('加法运算', args)
    elif x == '-':
        print('减法运算', args)
    else:
        print('请指定加减法类型！')

# func('+', 200, 300, 400)  # 加法运算 (200, 300, 400)
func('-', 200, 300, 400)  # 减法运算 (200, 300, 400)