# 变量的作用域
'''
局部变量
    函数内定义的变量， 在函数外不能使用 函数内定义的变量
全局变量
    在函数内部使用 global 直接定义的变量，就是全局变量
    在函数外定义的变量，在函数内使用global 关键字进行声明，那么也是全局变量

globals() : 获取全局数据
locals() ： 获取当前作用域的数据

    在函数外定义的变量，函数可以获取但不可以更改

数据类型分两种：
    可变数据类型：在函数外定义的变量，在函数可以使用
    不可变数据类型；在函数外定义的变量，在函数内只能访问不能使用其他操作
'''


# num = 10

# def func():
#     # print(num)  # 在函数内可以获取函数外部的变量  # 在函数内不能直接更改函数外的变量
#     # love = 20  # 函数内定义的变量， 在函数外不能使用 函数内定义的变量为局部变量
#     global live  # 在函数内部使用 global 关键字定义的变量就是全局变量
#     live = 'iloveyou'
#     print(live)


# 在函数外使用函数
# globals() : 在任何位置都可以获取全局变量数据
# locals() ： 获取当前作用域的变量数据


# 函数也具有作用域

def outer():
    print('this is outer function')
    abc = 123  # 在局部函数中无法改变，但可以调用
    def inner():
        print('this is inner function')  # 函数内定义的函数，称为局部函数，函数外无法使用
        print(abc)

    inner()  # 局部函数在内调用才可在调用外函数时使用
outer()


